<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>runner</string>
		<key>creation_date</key>
		<date>2023-05-05T14:51:26Z</date>
		<key>munki_version</key>
		<string>6.3.1.4580</string>
		<key>os_version</key>
		<string>12.6.5</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>blocking_applications</key>
	<array>
		<string>c4dpy.app</string>
		<string>Cinema 4D.app</string>
		<string>Cinema 4D Team Render Client.app</string>
		<string>Cinema 4D Team Render Server.app</string>
		<string>Cineware.app</string>
		<string>Commandline.app</string>
	</array>
	<key>catalogs</key>
	<array>
		<string>test</string>
	</array>
	<key>category</key>
	<string>Graphics</string>
	<key>description</key>
	<string>Easy to learn and extremely powerful: Cinema 4D is the perfect package for all 3D artists who want to achieve breathtaking results fast and hassle-free.</string>
	<key>developer</key>
	<string>Maxon</string>
	<key>display_name</key>
	<string>Cinema 4D</string>
	<key>installer_item_hash</key>
	<string>879d755f5fbf1bf6929351dafca5bca8819c915ca80e9d945f7a22f5edf9b12a</string>
	<key>installer_item_location</key>
	<string>Cinema4D-R25-25.121.pkg</string>
	<key>installer_item_size</key>
	<integer>555418</integer>
	<key>minimum_os_version</key>
	<string>10.5.0</string>
	<key>name</key>
	<string>Cinema4D</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>0</integer>
			<key>packageid</key>
			<string>com.maxon.Cinema4D-R25.pkg</string>
			<key>version</key>
			<string>25.121</string>
		</dict>
	</array>
	<key>unattended_install</key>
	<true/>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/bash

#Delete the application
rm -rf /Applications/Maxon\ Cinema\ 4D\ R25

#Forget the package receipt
pkgutil --forget com.maxon.Cinema4D-R25.pkg</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>25.121</string>
</dict>
</plist>
