<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>runner</string>
		<key>creation_date</key>
		<date>2023-06-22T15:52:04Z</date>
		<key>munki_version</key>
		<string>6.3.1.4580</string>
		<key>os_version</key>
		<string>12.6.6</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>test</string>
	</array>
	<key>category</key>
	<string>Development</string>
	<key>description</key>
	<string>Docker for Mac is an easy-to-install desktop app for building, debugging and testing Dockerized apps on a Mac. Docker for Mac is a complete development environment deeply integrated with the MacOS Hypervisor framework, networking and filesystem. Docker for Mac is the fastest and most reliable way to run Docker on a Mac.</string>
	<key>developer</key>
	<string>Docker Inc</string>
	<key>display_name</key>
	<string>Docker</string>
	<key>installed_size</key>
	<integer>1925532</integer>
	<key>installer_item_hash</key>
	<string>331b0efd170b52728e0ff82f6b7bfed1b6cd6316ce9e79e68a6de8794619768e</string>
	<key>installer_item_location</key>
	<string>docker-x86_64-4.20.1.pkg</string>
	<key>installer_item_size</key>
	<integer>786876</integer>
	<key>minimum_os_version</key>
	<string>10.5.0</string>
	<key>name</key>
	<string>docker</string>
	<key>postuninstall_script</key>
	<string>#!/bin/bash
#
# This script just reverses the postinstall operations
#

# Unload networking
# (use -F to force this; there are probably better ways to do this
# but this margin isn't big enough ...)
/bin/launchctl unload -F /Library/LaunchDaemons/com.docker.vmnetd.plist

rm -f /Library/LaunchDaemons/com.docker.vmnetd.plist
rm -f /Library/PrivilegedHelperTools/com.docker.vmnetd
rm -f /var/tmp/com.docker.vmnetd.socket

for tool in docker docker-compose docker-diagnose docker-machine notary; do
	rm -f /usr/local/bin/${tool}
done
</string>
	<key>receipts</key>
	<array>
		<dict>
			<key>installed_size</key>
			<integer>1925532</integer>
			<key>packageid</key>
			<string>com.docker.docker</string>
			<key>version</key>
			<string>4.20.1</string>
		</dict>
	</array>
	<key>supported_architectures</key>
	<array>
		<string>x86_64</string>
	</array>
	<key>unattended_install</key>
	<true/>
	<key>uninstall_method</key>
	<string>removepackages</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>4.20.1</string>
</dict>
</plist>
