<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>runner</string>
		<key>creation_date</key>
		<date>2023-07-18T04:36:21Z</date>
		<key>munki_version</key>
		<string>6.3.1.4580</string>
		<key>os_version</key>
		<string>12.6.7</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>test</string>
	</array>
	<key>category</key>
	<string>Development</string>
	<key>description</key>
	<string>Create and send any HTTP request using the awesome Postman request builder. Write your own test cases to validate response data, response times, and more!</string>
	<key>developer</key>
	<string>Postdot Technologies, Inc.</string>
	<key>display_name</key>
	<string>Postman</string>
	<key>installer_item_hash</key>
	<string>631d0fca0f73abc44f68831b5f84fd8f81f82355499dfcac3793daf9772f23a0</string>
	<key>installer_item_location</key>
	<string>Postman-10.16.0.dmg</string>
	<key>installer_item_size</key>
	<integer>175871</integer>
	<key>installer_type</key>
	<string>copy_from_dmg</string>
	<key>installs</key>
	<array>
		<dict>
			<key>CFBundleIdentifier</key>
			<string>com.postmanlabs.mac</string>
			<key>CFBundleName</key>
			<string>Postman</string>
			<key>CFBundleShortVersionString</key>
			<string>10.16.0</string>
			<key>CFBundleVersion</key>
			<string>10.16.0</string>
			<key>minosversion</key>
			<string>10.11.0</string>
			<key>path</key>
			<string>/Applications/Postman.app</string>
			<key>type</key>
			<string>application</string>
			<key>version_comparison_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
	</array>
	<key>items_to_copy</key>
	<array>
		<dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>Postman.app</string>
		</dict>
	</array>
	<key>minimum_os_version</key>
	<string>10.11.0</string>
	<key>name</key>
	<string>Postman</string>
	<key>preinstall_alert</key>
	<dict>
		<key>alert_detail</key>
		<string>You must contact IT Support to request a license for this software.</string>
		<key>alert_title</key>
		<string>Licensed Software</string>
		<key>cancel_label</key>
		<string>Cancel</string>
		<key>ok_label</key>
		<string>Install</string>
	</dict>
	<key>supported_architectures</key>
	<array>
		<string>x86_64</string>
	</array>
	<key>unattended_install</key>
	<true/>
	<key>unattended_uninstall</key>
	<true/>
	<key>uninstall_method</key>
	<string>remove_copied_items</string>
	<key>uninstallable</key>
	<true/>
	<key>version</key>
	<string>10.16.0</string>
</dict>
</plist>
