<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Blender</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Graphics</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>Blender</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>test</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Blender is the open source, cross platform suite of tools for 3D creation.</string>
			<key>developer</key>
			<string>The Blender Foundation</string>
			<key>display_name</key>
			<string>Blender</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.Blender</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>io.github.hjuutilainen.download.Blender</key>
			<dict>
				<key>git_hash</key>
				<string>d3c9df4fab10c25867133a825e2ed5e2fde5d08e</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Blender/Blender.download.recipe</string>
				<key>sha256_hash</key>
				<string>66d6c1212cf4e786bfd54957facc531e83dafe4a688c23570cce58181f36d6c8</string>
			</dict>
			<key>io.github.hjuutilainen.munki.Blender</key>
			<dict>
				<key>git_hash</key>
				<string>182786eea79ea18b3640d64a8d7fd1faf2374bda</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Blender/Blender.munki.recipe</string>
				<key>sha256_hash</key>
				<string>737b97fb340338f54cce543a572d25fea287e5583ac0b55b105c17b3d45fb17e</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
