<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.PlasticSCM-cloud</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>PlasticSCM-cloud</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>PlasticSCM.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>test</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Plastic SCM is now Unity Version Control, a component of Unity DevOps. Unity Version Control is a scalable, engine-agnostic version control and source code management tool for game development studios of all sizes.</string>
			<key>developer</key>
			<string>Unity Technologies</string>
			<key>display_name</key>
			<string>PlasticSCM - Cloud Edition</string>
			<key>icon_name</key>
			<string>PlasticSCM.png</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.joncrain.munki.PlasticSCM-cloud</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.joncrain.download.PlasticSCM-cloud</key>
			<dict>
				<key>git_hash</key>
				<string>9c40cedc94c011e69aed5f30b3e4ade20aae9c65</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.joncrain-recipes/PlasticSCM/PlasticSCM-cloud.download.recipe</string>
				<key>sha256_hash</key>
				<string>3fd4b457358f2563c30811f5eb6b6bf83f01e87ee7883efb68cee74f0f7c7876</string>
			</dict>
			<key>com.github.joncrain.munki.PlasticSCM-cloud</key>
			<dict>
				<key>git_hash</key>
				<string>9c40cedc94c011e69aed5f30b3e4ade20aae9c65</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.joncrain-recipes/PlasticSCM/PlasticSCM-cloud.munki.recipe</string>
				<key>sha256_hash</key>
				<string>4299e9208fc15a8f59b90001e70366a236c8e0379b2082d8e322cbc7c2b8881d</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
