<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.TechSmithSnagit</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>TechSmithSnagit</string>
		<key>SNAGIT_KEY</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Snagit</string>
				<string>SnagitAppleScriptExecutor</string>
				<string>SnagitHelper</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>test</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Use images and videos to show people exactly what you're seeing. Snagit gives you an easy way to quickly provide better feedback, create clear documentation, and change the way you work together.</string>
			<key>developer</key>
			<string>TechSmith</string>
			<key>display_name</key>
			<string>Snagit</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/sh

# Remove previous version of Snagit from /Applications

if [ -d "/Applications/Snagit.app" ]; then
	/bin/rm -rf "/Applications/Snagit.app"
fi
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.kernsb.munki.TechSmithSnagit</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>TechSmithURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>7c3cf55f0431b924b601491644469969baf0b088</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.bkerns-recipes/TechSmithSnagit/TechSmithURLProvider.py</string>
				<key>sha256_hash</key>
				<string>7c914b040017d8662c5b706d9c22b0c14c5c7839871520c308e8cafaae015d75</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.kernsb.download.TechSmithSnagit</key>
			<dict>
				<key>git_hash</key>
				<string>ceff806df61270433bc2d697fd2b8c3ac234cb11</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.bkerns-recipes/TechSmithSnagit/TechSmithSnagit.download.recipe</string>
				<key>sha256_hash</key>
				<string>cb1f78e03d64210f3c9089a8c40fb5d3638a1114562d3741392b66daa660fb3d</string>
			</dict>
			<key>com.github.autopkg.kernsb.munki.TechSmithSnagit</key>
			<dict>
				<key>git_hash</key>
				<string>691768010b8823a94687250d28d73097d658516f</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.bkerns-recipes/TechSmithSnagit/TechSmithSnagit.munki.recipe</string>
				<key>sha256_hash</key>
				<string>9b8f226b71ab5a113fea7f21777f96920c7284cbf5cd264368d20b90b7aeaa1a</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
